package com.moco.finalProject;

import java.text.DateFormat;
import java.util.Date;
import java.util.Locale;

import javax.inject.Inject;
import javax.servlet.http.HttpSession;

import org.slf4j.Logger;
import org.slf4j.LoggerFactory;
import org.springframework.stereotype.Controller;
import org.springframework.ui.Model;
import org.springframework.web.bind.annotation.RequestMapping;
import org.springframework.web.bind.annotation.RequestMethod;

import com.moco.directorBoard.invest.InvestService;
import com.moco.member.MemberDTO;
import com.moco.movieAPI.BasicMovieDTO;
import com.moco.movieAPI.BasicMovieService;
import com.moco.movieAPI.Json.JsonMain;

/**
 * Handles requests for the application home page.
 */
@Controller
public class HomeController {
	@Inject
	JsonMain jsonMain;

	private static final Logger logger = LoggerFactory.getLogger(HomeController.class);

	/**
	 * Simply selects the home view to render by returning its name.
	 */
	@RequestMapping(value = "/", method = RequestMethod.GET)
	public String home(Locale locale, Model model) {
		Date date = new Date();
		DateFormat dateFormat = DateFormat.getDateTimeInstance(DateFormat.LONG, DateFormat.LONG, locale);

		String formattedDate = dateFormat.format(date);

		model.addAttribute("serverTime", formattedDate );

		String[] genre1 = {"쇼생크탈출","인생은아름다워","죽은시인의사회","포레스트검프","굿바이마이프랜드","헬프","동주","패왕별희","히든피겨스","여인의향기"
				,"그대를사랑합니다","아마데우스","캐스트어웨이","쉰들러리스트","굿윌헌팅","집으로","소원","코러스","아이엠샘","록키","피아니스트","내이름은칸","천국의아이들",
				"일급살인","지상의별처럼","블라인드사이드","시네마천국","로미오와줄리엣","맨발의꿈","빌리엘리어트","바람","인생","도가니","친정엄마","투게더","신데렐라맨",
				"바람과함께사라지다","피아니스트의전설","오아시스","킹콩을들다","쿨러닝","뷰티풀마인드","벤허","밴디트","핵소고지"};

		String[] genre2 = {"반지의제왕","천녀유혼","가위손","해리포터","캐리비안의해적","드라큐라","미녀와야수","스타더스트","조블랙의사랑","큐브","스트레인저댄픽션","찰리와초콜릿공장",
				"나니아연대기","천국의우편배달부","천년여우여우비","록키호러픽쳐쇼","13층","스파이더위크가의비밀","호빗","환생","더도어","오퍼나지","자투라","트와일라잇", "헨젤과그레텔",
				"시간을달리는소녀","디워","비스틀리","화피","코블러","이상한나라의앨리스","이클립스","혼스","섀도우헌터스","토르","크림슨피크","뉴문","타이탄","번개맨","황금나침반"};

		String[] genre3 = {"싸이코","뱀파이어와의인터뷰","에이리언","죠스","사탄의인형","무서운집","알포인트","장화,홍련","블레이드","딥블루씨","엑소시스트","렛미인","링","오펀",
				"데스티네이션","새벽의저주","쏘우","패컬티","여고괴담","컨저링","팬도럼","이블데드","데드얼라이브","맨인더다크","더셀","매드니스","떼시스","불신지옥","더로드","하우스오브왁스",
				"스켈리톤키","시실리2km","마마","1408","스테이크랜드","23아이덴티티","미러","사일런트힐","유아넥스트","인시디어스","셔터","혼숨","기담","파라노말액티비티","라이트아웃",
				"데블","베이컨시","크레이지","미스트","위자","더웹툰","메디엄","아랑","령","할로우맨"};

		String[] genre4 = {"사운드오브뮤직","클래식","타이타닉","사랑의블랙홀","어바웃타임","사랑과영혼","이터널선샤인","이프온리","첨밀밀","첫키스만50번째","러브어페어","너는내운명","노트북",
				"파이란","노팅힐","성원","번지점프를하다","동감","오버더레인보우","블루라군","선물","보디가드","러브액츄얼리","청설","마법에걸린사랑","연애소설","당신이잠든사이에","그해여름",
				"다만,널사랑하고있어","더티댄싱","비포선라이즈","블랙북","로드무비","미술관옆동물원","스텝업","아티스트","시라노","약속","귀여운여인","후아유","내머리속의지우개","퐁네프의연인들",
				"늑대소년","건축학개론","접속","로맨틱홀리데이","레터스투줄리엣","페인티드베일","리틀디제이","비커밍제인","싸이보그그녀","오싹한연애","미비포유","킹덤오브헤븐","내일의기억"};

		String[] genre5 = {"나홀로집에","쥬만지","에이트빌로우","빠삐용","블러드다이아몬드","버킷리스트","인디아나존스","구니스","볼트","진용","스노우워커","레이더스","킹콩","본슈프리머시",
				"미션임파서블","라이프오브파이","월터의상상은현실이된다","괴물","더폴","트래쉬","정글북","노스페이스","마션","거울나라의앨리스","벤허","허비","해적","피터와드래곤","로드투퍼디션",
				"벼랑위의포뇨","127시간","워터월드","워터호스","박물관이살아있다","내셔널트레져","버티칼리미트","패신저스","잃어버린세계를찾아서","퍼시잭슨과괴물의바다","내셔널트레져","차이니즈조디악",
				"팬","오스트레일리아","더로드","레버넌트","쥬라기공원","닌자터틀","거친녀석들","에베레스트","차우","해운대","갓오브이집트","포비든킹덤","틴틴","타임라인","투모로우랜드","핑크팬더",
				"헐크","디텐스","성룡의신화","아나콘다","리딕","베오울프"};

		String[] genre6 = {"미져리","분노","프레스티지","몽타주","올가미","범죄의여왕","리턴","해피엔드","더재킷","나를찾아줘","더테러라이브","제로다크서티","작전명발키리","프리즈너스",
				"퍼펙트스톰","블라인드","무언의목격자","썸오브올피어스","밀레니엄","프리즈프레임","머시니스트","히든페이스","하루","디스터비아","인썸니아","함정","거미숲","엑스페리먼트","섬",
				"28일후","28주후","뷰티풀크리처스","손님은왕이다","소셜포비아","마진콜","존윅","더바디","언더월드","엣지오브다크니스","패닉룸","더독","썸","에어포스원","모스트원티드맨",
				"시크릿","사이드이펙트","이웃사람","프로즌그라운드","실종","더게임","골든슬럼버","더큐어","그림자살인","팜프파탈","인베이젼","맨온렛지","스토커","더리치","퍼펙트겟어웨이"};

		String[] genre7 = {"달콤한인생","18","하이힐","사생결단","창수","친구","런던블러바드","깡치"};

		String[] genre8 = {"울지마톤즈","자백","뚜르","슈퍼소닉","더코브","트루맛쇼","잉여들의히치하이킹","님아그강을건너지마오","식코","인사이드잡","말하는건축가","비상","댄서","빅뱅메이드",
				"에이미","고양이춤","김정일리아","다음침공은어디","노무현입니다","우리학교","우린액션배우다","서칭포슈가맨","더플랜","쿼바디스","더데이","테양아래","서태지심포니","불편한진실",
				"액트오브킬링","워낭소리","지구","슈퍼사이즈미","7년","화씨911","회복","만신","맥코리아","나는갈매기","오션스","잭애스","아이엠"};

		String[] genre9 = {"미세스다웃파이어","세얼간이","서유기","언터처블","모던타임즈","트루먼쇼","위대한독재자","라따뚜이","엽기적인그녀","패밀리맨","스팅","로마의휴일","과속스캔들",
				"빅","라디오스타","시스터액트","취권","마틸다","마스트","즐거운인생","아는여자","클릭","패치아담스","써니","시스터액트","우드잡","브루스올마이티","이보다더좋을순없다",
				"기쿠지로의여름","피케이","댄싱퀸","선생김봉두","코요테어글리","아멜리에","7번방의선물","예스맨","라이어라이어","소림축구","터미널","쉐프","미녀는괴로워","희극지왕","스파이",
				"그녀를믿지마세요","어바웃어보이","락앤롤보트","엘프","러시아워","프리키프라이데이","브링잇온","송포유","신데렐라스토리","웨딩싱어","아메리칸셰프","말리와나","화이트칙스","캐쉬백"};

		String[] genre10 = {"아름다운비행","오즈의마법사","리멤버타이탄","스쿨오브락","하치이야기","후크","피터팬","카","마음이","투브라더스","우리는동물원을샀다","하늘이보내준딸","해피피트",
				"걸어도걸어도","날아라허동구","우리개이야기","동경가족","프린세스다이어리","리지맥과이어","춘몽","아이스케키","휴고","빨간모자의진실","깡철이","콩가네"};

		String[] genre11 = {"바닐라스카이","데블스에드버킷","폰부스","무명인","그랜드부다페스트호텔","미씽","검은사제들","리스본행야간열차","데스노트","리미트리스","겟아웃","천사와악마","웃는남자",
				"줄리아의눈","백야행","적인걸","화차","인페르노","조용한세상","초감각커플","시간위의집","오드토머스","베스트셀러","곡성","클로버필드10번지","더기프트","소녀","오큘러스","그때그사람들",
				"다빈치코드","된장","포스카인드","빌리지","싸이퍼","조난자들","레드라이트","살인소설","굿셰퍼드","타임크라임","유령작가","극락도살인사건","두개의달","가비","사이코메트리","컨테이젼"};

		String[] genre12 = {"라이언일병구하기","태극기휘날리며","플래툰","블랙호크다운","메리크리스마스","에너미앳더게이트","진링의13소녀","고지전","실미도","진주만","스탈린그라드","태양의제국",
				"보리밭을흔드는바람","허트로커","워호스","에너미라인스","바스터즈","포화속으로","브라더스","황시","위워솔저스","디파이언스","인천상륙작전","님은먼곳에","명장","제9중대","아버지의깃발",
				"삼국지","묵공","적벽대전","집결호","알렉산더","작은연못","서부전선","혈투"};

		String[] genre13 = {"월E","토이스토리","센과치히로의행방불명","주토피아","드래곤길들이기","알라딘","모노노케히메","라푼젤","아이언자이언트","타잔","천공의성라퓨타","오세암","스피릿",
				"업","아기공룡둘리","주먹왕랄프","인어공주","라이온킹","몬스터주식회사","코난","바람계곡의나우시카","니모를찾아서","인크레더블","아나스타샤","보루토","뮬란","흑집사","크루즈패밀리",
				"이집트왕자","모아나","이웃집토토로","동급생","가디언즈","겨울왕국","늑대아이","빅히어로","하울의움직이는성","에반게리온","인사이드아웃","터보","벅스라이프","마다가스카","쿵푸팬더",
				"메리와맥스","리오","슈퍼배드","마녀배달부키키","드래곤길들이기"};

		String[] genre14 = {"레옹","프리퀀시","대부","칼리토","그랜토리노","JFK","그린마일","어퓨굿맨","공공의적","아메리칸히스토리X","캐치미이프유캔","히트","타짜","무간도","추격자","세븐데이즈",
				"내부자들","도니브래스코","양들의침묵","끝까지간다","스카페이스","트레인스포팅","신세계","프라이멀피어","슬럼독밀리어네어","메멘토","시티오브갓","보이A","펄프픽션","비열한거리","범죄의재구성",
				"유주얼서스펙트","홀리데이","부당거래","베스트오퍼","로드오브워","세븐","침묵의목격자","몬스터","범죄와의전쟁","작전","강철중","리플리","이탈리안잡","트리플9","로스트인더스트","거북이달린다",
				"더콜","나우유씨미","복수는나의것","우아한세계","특별수사","저수지의개들","아메리칸싸이코","분노의질주","파고","쓰리데이즈","21그램","원라인","링컨차를타는변호사","스워드피쉬","시카리오"};

		String[] genre15 = {"사랑은비를타고","하이스쿨뮤지컬","물랑루즈","씽","시카고","헤어스프레이","삼거리극장","락오브에이지","나인"};

		String[] genre16 = {"터미네이터","매트릭스","빽투더퓨쳐","바이센테니얼맨","에이아이","혹성탈출","마이너리티리포느","가타카","로보캅","이티","스타워즈","인터스텔라","아바타","케이팩스","엑스맨",
				"아마겟돈","디스트릭트9","지구를지켜라","아이언맨","엑스맨","12몽키즈","공각기동대","토탈리콜","트랜스포머","블레이드러너","아일랜드","딥임팩트","아이,로봇","13구역","스타트렉","레지던트이블",
				"더문","다크시티","칠드런오브맨","그래비티","코어","클라우드아틀라스","타임패러독스","인디펜던스데이","루퍼","패스워드","더기버","헬보이","미션투마스","샤토라레","이노센스","화성침공","다이버전트",
				"고질라","스폰","이벤트호라이즌","프로메테우스","픽셀","임포스터","페이첵","호스트","스파이더맨","우주전쟁","언브레이커블","에코"};

		String[] genre17 = {"글래디에이터","다크나이트","클레멘타인","더록","취권","영웅","폴리스스토리","동방불패","본얼티메이텀","다이하드","브레이브하트","엽문","해바라기","아저씨","인셉션","페이스오프",
				"록키","천장지구","테이큰","크림슨타이드","보디가드","영웅본색","도망자","네고시에이터","7인의사무라이","프레데터","투캅스","정무문","브레이크다운","노킹온헤븐스도어","에너미오브스테이트","배트맨",
				"스피드","스트레인저","콘에어","클리프행어","리얼스틸","원스어폰어타임인아메리카","첩혈쌍웅","로건","불꽃슛통키","론서바이버","러시","게임의법칙","브이포벤데타","솔드아웃","암살","소스코드","볼케인노",
				"파이트클럽","비트","록키발보아","와일드카드","복수혈전","의형제","영화는영화다","맨온파이어","이퀼리브리엄","심연","쉬리","킹스맨","제5원소","닥터스트레인지","페르시아의왕자","워크래프트"};
		/*for(int i=0; i<genre1.length; i++){
			jsonMain.JsonMain(genre1[i]);
		}
		for(int i=0; i<genre2.length; i++){
			jsonMain.JsonMain(genre2[i]);
		}
		for(int i=0; i<genre3.length; i++){
			jsonMain.JsonMain(genre3[i]);
		}
		for(int i=0; i<genre4.length; i++){
			jsonMain.JsonMain(genre4[i]);
		}
		for(int i=0; i<genre5.length; i++){
			jsonMain.JsonMain(genre5[i]);
		}
		for(int i=0; i<genre6.length; i++){
			jsonMain.JsonMain(genre6[i]);
		}
		for(int i=0; i<genre7.length; i++){
			jsonMain.JsonMain(genre7[i]);
		}
		for(int i=0; i<genre8.length; i++){
			jsonMain.JsonMain(genre8[i]);
		}
		for(int i=0; i<genre9.length; i++){
			jsonMain.JsonMain(genre9[i]);
		}
		for(int i=0; i<genre10.length; i++){
			jsonMain.JsonMain(genre10[i]);
		}
		for(int i=0; i<genre11.length; i++){
			jsonMain.JsonMain(genre11[i]);
		}
		for(int i=0; i<genre12.length; i++){
			jsonMain.JsonMain(genre12[i]);
		}
		for(int i=0; i<genre13.length; i++){
			jsonMain.JsonMain(genre13[i]);
		}
		for(int i=0; i<genre14.length; i++){
			jsonMain.JsonMain(genre14[i]);
		}
		for(int i=0; i<genre15.length; i++){
			jsonMain.JsonMain(genre15[i]);
		}
		for(int i=0; i<genre16.length; i++){
			jsonMain.JsonMain(genre16[i]);
		}
		for(int i=0; i<genre17.length; i++){
			jsonMain.JsonMain(genre17[i]);
		}*/

		return "home";
	}

	@RequestMapping(value = "/user/userHome", method = RequestMethod.GET)
	public void userHome(){

	}

	@RequestMapping(value = "/movie/movieHome", method = RequestMethod.GET)
	public void movieHome(){

	}

}
